РП/src/Catalogs/ВидыРабочихЦентров/ВидыРабочихЦентров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыРабочихЦентров</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланироватьРаботу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МинимальныйЗначимыйБуфер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьДоступностьПоГрафикуРаботы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Календарь</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальнаяДоступностьРЦ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияДоступностиРЦ</name>
    <type>
      <types>EnumRef.ЕдиницыИзмеренияВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодОжидания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуютсяВариантыНаладки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаВремениПереналадки</name>
    <type>
      <types>EnumRef.ЕдиницыИзмеренияВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РезервДоступности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПараллельнаяЗагрузка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияЗагрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантЗагрузки</name>
    <type>
      <types>EnumRef.ВариантыЗагрузкиРабочихЦентров</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>EnumRef.ЕдиницыИзмеренияВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланироватьРаботуРабочихЦентров</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоРабочихЦентров</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВводитьДоступностьДляВидаРЦ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

РП/src/Enums/ВариантыЗагрузкиРабочихЦентров/ВариантыЗагрузкиРабочихЦентров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыЗагрузкиРабочихЦентров</name>
  <enumValues>
    <name>Синхронный</name>
  </enumValues>
  <enumValues>
    <name>Асинхронный</name>
  </enumValues>
</mdclass:Enum>

РП/src/Enums/ТочностьГрафикаПроизводства/ТочностьГрафикаПроизводства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТочностьГрафикаПроизводства</name>
  <enumValues>
    <name>Час</name>
  </enumValues>
  <enumValues>
    <name>День</name>
  </enumValues>
  <enumValues>
    <name>Неделя</name>
  </enumValues>
  <enumValues>
    <name>Месяц</name>
  </enumValues>
</mdclass:Enum>

РП/src/Catalogs/ВидыРабочихЦентров/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если НЕ ПланироватьРаботу Тогда
		МассивНепроверяемыхРеквизитов.Добавить("МаксимальнаяДоступностьРЦ");
		МассивНепроверяемыхРеквизитов.Добавить("ЕдиницаИзмеренияДоступностиРЦ");
	КонецЕсли;
	
	Если НЕ ИспользуютсяВариантыНаладки Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ЕдиницаВремениПереналадки");
	КонецЕсли; 
	
	Если НЕ ПараллельнаяЗагрузка Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ЕдиницаИзмеренияЗагрузки");
		МассивНепроверяемыхРеквизитов.Добавить("ВариантЗагрузки");
	КонецЕсли; 
	
	Если НЕ ПараллельнаяЗагрузка 
		ИЛИ ВариантЗагрузки <> Перечисления.ВариантыЗагрузкиРабочихЦентров.Синхронный 
		ИЛИ ИспользуютсяВариантыНаладки Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ВремяРаботы");
		МассивНепроверяемыхРеквизитов.Добавить("ЕдиницаИзмерения");
	КонецЕсли; 
	
	Если ПланироватьРаботу Тогда
	ПроверитьМаксимальнуюДоступностьРЦ(Отказ);
	КонецЕсли; 
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	// Защита от неправильно установленных настроек
	Если ВводитьДоступностьДляВидаРЦ
		И (НЕ ПланироватьРаботу 
			ИЛИ НЕ УчитыватьДоступностьПоГрафикуРаботы) Тогда
			
		ВводитьДоступностьДляВидаРЦ = Ложь;
		КоличествоРабочихЦентров = 0;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьМаксимальнуюДоступностьРЦ(Отказ)

	ПараметрыПодразделения = ПроизводствоСервер.ПараметрыПроизводственногоПодразделения(Подразделение);
	
	ИнтервалПланирования = ПараметрыПодразделения.ИнтервалПланирования;
	
	Если ЗначениеЗаполнено(ИнтервалПланирования) 
		И ЗначениеЗаполнено(МаксимальнаяДоступностьРЦ) 
		И ЗначениеЗаполнено(ЕдиницаИзмеренияДоступностиРЦ) Тогда
		
		МаксимальнаяДоступностьРЦВСекундах = ПланированиеПроизводстваКлиентСервер.ПолучитьВремяВСекундах(МаксимальнаяДоступностьРЦ, ЕдиницаИзмеренияДоступностиРЦ);
		
		Если ИнтервалПланирования = Перечисления.ТочностьГрафикаПроизводства.Час Тогда
			ИнтервалВСекундах = 3600;
		ИначеЕсли ИнтервалПланирования = Перечисления.ТочностьГрафикаПроизводства.День Тогда
			ИнтервалВСекундах = 86400;
		ИначеЕсли ИнтервалПланирования = Перечисления.ТочностьГрафикаПроизводства.Неделя Тогда
			ИнтервалВСекундах = 604800;
		ИначеЕсли ИнтервалПланирования = Перечисления.ТочностьГрафикаПроизводства.Месяц Тогда
			ИнтервалВСекундах = 2592000;
		КонецЕсли;
		
		Если МаксимальнаяДоступностьРЦВСекундах > ИнтервалВСекундах Тогда
			ТекстСообщения = НСтр("ru='Максимальная доступность не должна превышать интервал планирования.';uk='Максимальна доступність не повинна перевищувати інтервал планування.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "МаксимальнаяДоступностьРЦ",, Отказ);
		КонецЕсли;
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
